from colorama import Fore, Back, Style
from tqdm import tqdm
import os
from requests import *
from pyfiglet import *
from threading import *
import sys
import sounddevice as sd
import time
from Cors.Setingdel.Coming import *

#===========================================================================================================================================

# LICENZION.py
# CHERRY GRF

def licenziondelpin():
    print ("Compiling GRF_CMD")
    for i in tqdm (range (100),
            desc=  "GRF_SYS [>] ",
            ascii=False, ncols=75):
        time.sleep(0.05)
    import os
    os.system('cls' if os.name == 'nt' else 'clear')
    time.sleep(1.0)

    print (Fore.YELLOW + " Лицензия CHERRY_CMD 5.0.0 " )
    print ("\n======================================================")
    print ("CHERRY_DEL TERMINAL system administration software for embedded systems.")
    print ("The system includes")
    print ("OS_DEL: The operating unit of the system. This module has a system for modules and the development of your models, as well as access to the Server in the system.DELL server")
    print ("management can be performed directly from your hardware. The special MY_SQL_DEL module allows you to use our databases. Soon we will allow you to create your databases and connect them to our system.")
    print ("GAMES_DEL: The game complex is designed for remote connection to popular games, for playing with friends. In the upcoming update, we will allow you to create your servers in a few clicks of the GAME: GTA-V")
    print ("======================================================\n")
    time.sleep(1.0)

    print ("\n=================================================================================")
    print ("The developer and creator of the system is Nikolay Nikitich Sbitnev")
    print ("Phone number +7 913 979 40 49")
    print ("Telegram @deliexsys")
    print ("Discord Kolor.KOL")
    print ("=================================================================================\n")
    time.sleep(1.0)

    print ("\nCherry.sys STR 105 build-#15 version-5.0.0. sys-del_version 2.0.0. @deliex  |")
    print (" ██████╗██╗  ██╗███████╗██████╗ ██████╗ ██╗   ██╗███████╗██╗   ██╗███████╗  |")
    print ("██╔════╝██║  ██║██╔════╝██╔══██╗██╔══██╗╚██╗ ██╔╝██╔════╝╚██╗ ██╔╝██╔════╝  |")
    print ("██║     ███████║█████╗  ██████╔╝██████╔╝ ╚████╔╝ ███████╗ ╚████╔╝ ███████╗  |")
    print ("██║     ██╔══██║██╔══╝  ██╔══██╗██╔══██╗  ╚██╔╝  ╚════██║  ╚██╔╝  ╚════██║  |")
    print ("╚██████╗██║  ██║███████╗██║  ██║██║  ██║   ██║██╗███████║   ██║   ███████║  |")
    print (" ╚═════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝╚═╝╚══════╝   ╚═╝   ╚══════╝  |")
    print ("-----------------------------------------------------------------------------")
    print ("        LOG-SYSTEM Информация и ключи доступа к системе Deliex.DEL          #")
    print ("_____________________________________________________________________________")
    print ("  #.Name sys                          |  #.Log system info code             |")
    print ("                                      |                                     |")
    print (" ID. >>>                              | 17082003@deliex.com                 |")
    print ("                                      |                                     |")
    print (" SYS-LOG. >>>                         | 5.7.9                               |")
    print ("                                      |                                     |")
    print (" SDNFG. >>>                           | 1537664523#server.del               |")
    print ("                                      |                                     |")
    print (" Структура. >>>                       | 105 sys [ON]                        |")
    print ("____________________________________________________________________________|\n")
    time.sleep(1.0)

    print (Fore.GREEN + "\n[ ВАЖНО ] \n================================================================================" + Fore.YELLOW)
    print ("Так же хотели бы обратить ваше внимание на файлы проекта. Изменение данных во всех вайлов по мимо,")
    print ("Setingdel/Coming.py. Строго запрещено. Код CHERRY_CMD полностью пренадлежит Сбитневу Николаю Никитичу. ")
    print ("Изменять файлы можно только Администраторам не выше 7-ранга.")
    print ("Так же поддержка не в праве изменять ваши файлы. Их работа вас направлять по системе.")
    print (Fore.GREEN + "\n================================================================================" + Fore.YELLOW)
    print ("\n")
    time.sleep(1.0)
    input (Fore.RED + " [ENTER] ")
    import os
    os.system('cls' if os.name == 'nt' else 'clear')

#===========================================================================================================================================

# bootsys.py
# BOOT GRF
# cherrycom = input(Fore.RED + GRF4 + "|                                                          |\n| >   DEL/SYS/BOOT                                        |\n" + Fore.YELLOW + "|                                                          |\n| !   [ START_LOG ]                                       |\n" + Fore.RED + "|                                                          |\n" + GRF41 + " ?   >>>  ")
bGRF =  ("_________________________________________________________________________________________________\n")
bGRF2 = ("=================================================================================================\n")
bGRF3 = ("_______________________________________________\n")
bGRF4 =  ("===== BOOT-MENU ============================================\n")
bGRF41 = ("============================================ BOOT-MENU =====\n \n")
GRFBOOT = (Fore.RED + bGRF4 + "| " + Fore.RED + " >   BOOT/ [ " + ST2 + " ]                             " + Fore.RED + " ___|\n" + Fore.RED + "|_ >>> " + Fore.YELLOW)

# CHERRY_DEL GRF
cGRF =  ("_________________________________________________________________________________________________\n")
cGRF2 = ("=================================================================================================\n")
cGRF3 = ("_______________________________________________\n")
cGRF4 = ("============================================================\n")
cGRF5 = ("===== < Cherry.CMD 5.0.0 TERMINAL SYS > ====================\n")
GRFCHME = (Fore.GREEN + cGRF5 + "| " + Fore.CYAN + " >   BOOT/SYS/                                       " + Fore.GREEN + " ___|\n" + Fore.GREEN + "|_ >>> " + Fore.YELLOW)

def prcmenu ():
    print (Fore.YELLOW + "\n__________________________________________________________________")
    print("==================== Меню CHERRY CMD =============================")
    print("= CHERRY_CMD v.5.0.0      COM   [ " + CHD + " ]")
    #print("= CHERRY_DEL v.5.0.0      GRF   [ CHDGMR ]")
    print("= CHERRY_SYS v.ONL-3.5.0  COM   [ " + SRD + " ]")
    #print("= CHERRY_SYS v.ONL-3.5.0  GRF   [ SRDGMR ]")
    print("__________________________________________________________________\n" + Fore.CYAN)

def prchelp ():
    print (Fore.YELLOW + "\n__________________________________________________________________")
    print("========================== SETINGS CMD SYS =======================")
    print("= Меню программ                            [ " + MEN + " ]")
    print("= Справочник комманд                       [ " + HEL + " ]")
    print("= Информация о программном обеспечении     [ " + INF + " ]")
    print("= Отчистить консоль системы                [ " + CL1 + " ]")
    print("= Глобальный выход из системы              [ " + EX2 + " ]")
    print("___________________________________________________________________\n" + Fore.CYAN)

def prcinfo ():
    print (Fore.YELLOW + "\n__________________________________________________________________")
    print("==================== INFO CHERRY CMD =============================")
    print("= [ " + CHD + " ] Консольный режим CHERRY_CMD. Коммандное упровление системой.")
    #print("= [ CHDGMR ] Графический режим CHERRY_CMD. Кликабельное упровление системой.")
    print("= [ " + SRD + " ] Консольный режим CHERRY_SYS. Отправка комманд на сервер DEL с коммандной строки.")
    #print("= [ SRDGMR ] Графический режим CHERRY_SYS. Графическое общение и выполнение процедур с сервером CMD.")
    print("__________________________________________________________________\n" + Fore.CYAN)

#===========================================================================================================================================

# Cherrymenu.py
# CHERRY GRF
print (Style.BRIGHT)
mcGRF =  ("_________________________________________________________________________________________________\n")
mcGRF2 = ("=================================================================================================\n")
mcGRF3 = ("_______________________________________________\n")
mcGRF4 = ("============================================================\n")
mcGRF5 = ("===== < Cherry.CMD 5.0.0 OFLINE-SYS > ======================\n")
GRFMECH = (Fore.CYAN + mcGRF5 + "| " + Fore.YELLOW + " >   CMD/SYS/   [ LS -M ]                            " + Fore.CYAN + " ___|\n" + Fore.CYAN + "|_ >>> " + Fore.WHITE)
GRFSYSDEL = (Fore.BLUE + mcGRF5 + "| " + Fore.YELLOW + " >   CMD/SYS/OS                                      " + Fore.BLUE + " ___|\n" + Fore.BLUE + "|_ >>> " + Fore.YELLOW)
FLM = ("[==================== MODUL ====================]")

def flm1 ():
    print(FLM)
    print (Fore.RED + " \n [X] Если выбраный вами модуль не запускается. \n [!] То попробуйте запустить его через систему ["+OM1+"] ")
    input (Fore.GREEN + " \n [!] Для продолжения нажмите [ ENTER ] ")

def flm2 ():
    print(FLM)
    print (Fore.RED + " \n [X] Если выбраный вами модуль не запускается. \n [!] А так же не запускается через встройный сектор то. ")
    print (Fore.YELLOW + " \n [?] Обратитесь в поддержку [ https://t.me/logdeliex_bot ] \n \n "+ mcGRF4)

#===========================================================================================================================================

# Stgame.py
# CHERRY GRF

gmGRF =  ("_________________________________________________________________________________________________\n")
gmGRF2 = ("=================================================================================================\n")
gmGRF3 = ("_______________________________________________\n")
#GRF4 = ("===========================================================\n")
#GRF5 = ("===== < GAMES_CMD 3.5.0 TERMINAL SYS > ====================\n")
gmGRF4 = ("===== GAMES_CMD ===========================================\n")
#GRF5 = ("=========================================== GAMES_CMD =====\n")
GRGAMEMENU = (Fore.YELLOW + gmGRF4 + "| " + Fore.CYAN + " >   BOOT/SYS/CHERRY/GAMES                          " + Fore.YELLOW + " ___|\n" + Fore.YELLOW + "|_ >>> " + Fore.MAGENTA)

def gmmenu():
    print (Fore.MAGENTA + "\n__________________________________________________________________")
    print("==================== Меню системы CMD ============================")
    print("= GAMES_CMD v.3.5.0      COM   [ " + GDM + " ]   =")
    print("= GAMES_CMD v.3.5.0      GRF   [ " + GRFG + " ]   =")
    print("__________________________________________________________________\n" + Fore.CYAN)

def gminfo():
    print (Fore.MAGENTA + "\n__________________________________________________________________")
    print("==================== Меню системы CMD ============================")
    print("= [ " + GDM + " ] Консольный режим GAMES_CMD. Коммандное упровление системой.\n")
    print("= [ " + GRFG + " ] Графический режим GAMES_CMD. Кликабельное упровление системой.\n")
    print("__________________________________________________________________\n" + Fore.CYAN)

#===========================================================================================================================================

# menu-GM.py
# CHERRY GRF

GAMEMENUSYS = (Fore.YELLOW + "<-- GAMES_CMD/SYS/MENU -> | " + Fore.WHITE )
OSGAMESYS = (Fore.BLUE + "\n|__ >>> |: " + Fore.YELLOW )

def gmsyshelp():
    print (Fore.MAGENTA + "\n__________________________________________________________________")
    print("==================== Меню системы CMD ============================")
    print("= Системные игры          [ " + OM1 + " ]")
    print(Fore.RED + "= Настройки программы     [ SYS ]" + Fore.MAGENTA)
    print("__________________________________________________________________\n" + Fore.CYAN)

def gmsysgames():
    print (Fore.MAGENTA + "\n__________________________________________________________________")
    print("==================== Меню системы CMD ============================")
    print("= Нет игр в системе CMD =")
    print("__________________________________________________________________\n" + Fore.CYAN)

#===========================================================================================================================================

# menusys-SERVER.py
# CHERRY GRF

srGRF =  ("_________________________________________________________________________________________________\n")
srGRF2 = ("=================================================================================================\n")
srGRF3 = ("_______________________________________________\n")
srGRF4 = ("===== SERVER_CMD ===========================================\n")
GRSERMENU = (Fore.RED + srGRF4 + "| " + Fore.GREEN + " >   BOOT/SYS/CHERRY/SERVER                          " + Fore.YELLOW + " ___|\n" + Fore.YELLOW + "|_ >>> " + Fore.RED)
PRAVASER = ( " " + YE1 + "/" + NO1 + " : >>> " )

def sermenu():
    print (Fore.YELLOW + "\n__________________________________________________________________")
    print("==================== Меню системы CMD ============================")
    print("= SERVER_CMD v.3.5.0      COM   [ " + SE5 + " ]")
    print(Fore.RED + "= SERVER_VIR v.3.5.0      VIR   [ " + SV5 + " ]" + Fore.YELLOW)
    print("__________________________________________________________________\n" + Fore.CYAN)

def serinfo():
    print (Fore.YELLOW + "\n__________________________________________________________________")
    print("==================== Меню системы CMD ============================")
    print("= [ " + SE5 + " ] Консольный режим SERVER_CMD. Создание своего собственного сервера.\n")
    print("= [ " + SV5 + " ] Графический режим SERVER_VIR. Подключение к виртуальному окружению для упровления системой SERVER_SYS.\n")
    print("__________________________________________________________________\n" + Fore.CYAN)

def erword():
    print ( " [!!!] Вы должны понимать что вы сейчас перейдёте в среду создания и распростронения вашей машины. \n Назад в систему CHERRY_CMD вы не сможете вернутся. " )
    print ( " Так как система SERVER_CMD передаёт соеденение. \n Во время передачи соеденения вам необходимо пользоватся второй системой CHERRY_CMD. " )
    print ( " В ней вы сможете отпровлять комманды на ваш исходный сервер. \n " + SV5 + " Не доступен. Система на разработке. " )
    print ( " Вы готовы перейти к созданию своего сервера. На базе SERVER_CMD/DELIEX_SYS ? " )

#===========================================================================================================================================

# config-SERVER.py
# CHERRY GRF

def confwelc():
    print ( Fore.CYAN + "\n \n [!] Добро пожаловать в создание Server_CMD." )
    print ( Fore.BLUE + "\n [INFO] Рекомендуется проверять работоспособность сервера. \n [INFO] Если возникают вопросы (Обращение: +7 913 979 40 49 & https://t.me/logdeliex_bot ) " )

    print ( Fore.WHITE + "\n ====================== < SERVER-SYS 3.5.0 SETINGS-ON > ======================")
    print ( Fore.WHITE + "\n [!] Добавте значения для упровления сервером. Через клиент часть. " )

#===========================================================================================================================================

# server-SERVER.py
# CHERRY GRF

sfGRF =  ("_________________________________________________________________________________________________\n")
sfGRF2 = ("=================================================================================================\n")
sfGRF3 = ("_______________________________________________\n")
sfGRF4 = ("============================================================\n")
sfGRF5 = ("\n===== < Cherry.CMD 5.0.0 SER-3.5.0 > =======================\n")
sfGRF6 = ("\n===== < SERVER-SYS 3.5.0 CMD_SYS IP > ======================\n")
SERIPSYS = (Fore.CYAN + sfGRF6 + "| " + Fore.RED + " >   SERVER_CMD                                        " + Fore.CYAN + "\n" + Fore.CYAN + "|__>   IP-" + Fore.WHITE)

#===========================================================================================================================================

# Cherryonsys.py
# CHERRY GRF

GRF =  ("_________________________________________________________________________________________________\n")
GRF2 = ("=================================================================================================\n")
GRF3 = ("_______________________________________________\n")
GRF4 = ("============================================================\n")
GRF5 = ("\n===== < Cherry.CMD 5.0.0 SER-3.5.0 > =======================\n")
GRF6 = ("\n===== < SERVER-SYS 3.5.0 CMD_SYS IP > ======================\n")
CHONLINEIN = (Fore.CYAN + GRF5 + "| " + Fore.RED + " >   CMD/SER/                                        " + Fore.CYAN + " ___|\n" + Fore.CYAN + "|__>   IP-" + Fore.WHITE)

def offserver():
    print (Fore.RED +  " [!] Сервер отключен [ Причина не известно. ] ... \n=======================================================================" )

#===========================================================================================================================================
# COMMANDS CHERRY_DEL
# НЕ ТРОГАТЬ ТУТ УЖЕ ВСЁ НАСТРОЕННО !!!
def setcom():
    print(Fore.WHITE + " ======================================================================= " + Fore.WHITE )
    print(Fore.YELLOW + "  SYS/  " + Fore.WHITE)
    print(" >>> " + ST1 )
    print(" >>> " + CL1 )
    print(" >>> " + ENT1 + "\n")
    print(Fore.YELLOW + "  BOOT-MENU  " + Fore.WHITE )
    print(" >>> " + ST2 )
    print(" >>> " + EX2 )
    print(" >>> " + PI1 )
    print(Fore.YELLOW + "  BOOT/SYS/  " + Fore.WHITE )
    print(" >>> " + RB1 )
    print(" >>> " + ST3 )
    print(" >>> " + LIC )
    print(" >>> " + MEN )
    print(" >>> " + HEL )
    print(" >>> " + INF )
    print(" >>> " + CHD )
    print(" >>> " + SRD + "\n")
    print(Fore.YELLOW + "  CMD/SYS/  " + Fore.WHITE )
    print(" >>> " + GM1 )
    print(" >>> " + SER1 )
    print(" >>> " + OM1 )
    print(" >>> " + CD2 )
    print(" >>> " + LKC1 + "\n")
    print(Fore.YELLOW + "  BOOT/SYS/CHERRY/GAMES  " + Fore.WHITE )
    print(" >>> " + GDM )
    print(" >>> " + GRFG + "\n")
    print(Fore.YELLOW + "  GAMES_CMD/SYS/MENU  " + Fore.WHITE )
    print(" >>> " + GAM + "\n")
    print(Fore.YELLOW + "  BOOT/SYS/CHERRY/SERVER  " + Fore.WHITE )
    print(" >>> " + SE5 )
    print(" >>> " + SV5 )
    print(" >>> " + YE1 )
    print(" >>> " + NO1 )
    print(" >>> " + BTS + "\n")
    print(Fore.YELLOW + "  CMD/SER/  " + Fore.WHITE )
    print(" >>> " + NOT + "\n" + Fore.WHITE )
    print(" ======================================================================= " + Fore.WHITE )
    input(Fore.WHITE + " [ENTER]  " + Fore.RED )
    import os
    os.system('cls' if os.name == 'nt' else 'clear')

# END === >
#===========================================================================================================================================
